In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

In [2]:
# get the files from kaggle titanic challenge
train = pd.read_csv("train.csv")
test  = pd.read_csv("test.csv")
#gender_submission = pd.read_csv("gender_submission.csv")

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#func = lambda x: 0 if x == 'male' else 1
#train['Sex'] = train.Sex.apply(func)
train['Sex'] = train['Sex'].map({'male':0,'female':1})
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [7]:
# from sklearn.impute import SimpleImputer # use imputer later for now using fillna from pandas

mean_age = train['Age'].mean() 
train['Age'].fillna(value = mean_age, inplace = True)

In [8]:
# use oneHotEncoder later . for now manually encoding categorical attribute - passenger class 
train['Firstclass'] = train['Pclass'].apply(lambda x: 1 if x == 1 else 0)
train['Secondclass'] = train['Pclass'].apply(lambda x: 1 if x == 2 else 0)

In [9]:
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Firstclass,Secondclass
0,1,0,3,"Braund, Mr. Owen Harris",0,22.000000,1,0,A/5 21171,7.2500,NaN,S,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.000000,1,0,PC 17599,71.2833,C85,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.000000,1,0,113803,53.1000,C123,S,1,0
4,5,0,3,"Allen, Mr. William Henry",0,35.000000,0,0,373450,8.0500,NaN,S,0,0
5,6,0,3,"Moran, Mr. James",0,29.699118,0,0,330877,8.4583,NaN,Q,0,0
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.000000,0,0,17463,51.8625,E46,S,1,0
7,8,0,3,"Palsson, Master. Gosta Leonard",0,2.000000,3,1,349909,21.0750,NaN,S,0,0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.000000,0,2,347742,11.1333,NaN,S,0,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.000000,1,0,237736,30.0708,NaN,C,0,1

In [10]:
train_features = train[['Sex','Age','Firstclass','Secondclass']]
train_features.head(10)
y = train['Survived']

In [11]:
#split data to train and validation 

x_train,x_test,y_train,y_test = train_test_split(train_features,y,test_size = 0.10,random_state = 42)

In [12]:
# regularize data
scaler = StandardScaler()
x_train = scaler.fit_transform(x_train)
x_test = scaler.transform(x_test)

In [13]:
logreg = LogisticRegression()
logreg.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [14]:
# accuracy of model on train data - .score()
accu_train = logreg.score(x_train,y_train)
accu_train

0.7927590511860175

In [15]:
# test set .score
accu_test = logreg.score(x_test,y_test)
accu_test

0.8444444444444444

In [16]:
# checking for a sample passengers
Jack = np.array([0.0,20.0,0.0,0.0])
Rose = np.array([1.0,17.0,1.0,0.0])
sample_passengers = np.array([Jack,Rose])
sample_passengers = scaler.transform(sample_passengers)
predictions = logreg.predict(sample_passengers)
predictions

array([0, 1], dtype=int64)

In [17]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [18]:
# prediction on the actual test set 
# should have written a function to clean the data ! lesson learned!!
test['Sex'] = test['Sex'].map({'male':0,'female':1})
mean_age_test = test['Age'].mean()
test['Age'].fillna(value = mean_age_test, inplace = True)
test['Firstclass'] = test['Pclass'].apply(lambda x: 1 if x == 1 else 0)
test['Secondclass'] = test['Pclass'].apply(lambda x: 1 if x == 2 else 0)
test_features = test[['Sex','Age','Firstclass','Secondclass']]

test_features.head(10)

   Sex   Age  Firstclass  Secondclass
0    0  34.5           0            0
1    1  47.0           0            0
2    0  62.0           0            1
3    0  27.0           0            0
4    1  22.0           0            0
5    0  14.0           0            0
6    1  30.0           0            0
7    0  26.0           0            1
8    1  18.0           0            0
9    0  21.0           0            0

In [26]:
#regularize data
test_features = scaler.transform(test_features)

In [27]:
predictions_test = logreg.predict(test_features)

In [28]:
# submitting to kaggle 
s = pd.Series(data = predictions_test, name = 'Survived')
s.head()

0    0
1    0
2    0
3    0
4    1
Name: Survived, dtype: int64

In [29]:
submission = test['PassengerId']
submission = pd.concat([submission, s], axis=1)
submission.astype('int64').dtypes

PassengerId    int64
Survived       int64
dtype: object

In [30]:
submission.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [32]:
submission.to_csv('submission2.csv', index = False)